Rahix/avr-device/vendor/attiny461a.atdf
        <register caption="Timer/Counter0 Low" name="TCNT0L" offset="0x52" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x33" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x32" size="1" mask="0xFF"/>
      </register-group>
      <register-group caption="Timer/Counter, 8-bit" name="TC1">
        <register caption="Timer/Counter Control Register A" name="TCCR1A" offset="0x50" size="1">
          <bitfield caption="Compare Output Mode, Bits" mask="0xC0" name="COM1A"/>
          <bitfield caption="Compare Output Mode, Bits" mask="0x30" name="COM1B"/>
          <bitfield caption="Force Output Compare Match 1A" mask="0x08" name="FOC1A"/>
          <bitfield caption="Force Output Compare Match 1B" mask="0x04" name="FOC1B"/>
          <bitfield caption="Pulse Width Modulator Enable" mask="0x02" name="PWM1A"/>
          <bitfield caption="Pulse Width Modulator Enable" mask="0x01" name="PWM1B"/>
        </register>
        <register caption="Timer/Counter Control Register B" name="TCCR1B" offset="0x4F" size="1">
          <bitfield caption="PWM Inversion Mode" mask="0x80" name="PWM1X"/>
          <bitfield caption="Timer/Counter 1 Prescaler reset" mask="0x40" name="PSR1"/>
          <bitfield caption="Dead Time Prescaler" mask="0x30" name="DTPS1" values="MISC_2BIT_SCALE"/>
          <bitfield caption="Clock Select Bits" mask="0x0F" name="CS1" values="CLK_SEL_4BIT"/>
        </register>
        <register caption="Timer/Counter Control Register C" name="TCCR1C" offset="0x47" size="1">
          <bitfield caption="COM1A1 Shadow Bit" mask="0x80" name="COM1A1S"/>
          <bitfield caption="COM1A0 Shadow Bit" mask="0x40" name="COM1A0S"/>
          <bitfield caption="COM1B1 Shadow Bit" mask="0x20" name="COM1B1S"/>
          <bitfield caption="COM1B0 Shadow Bit" mask="0x10" name="COM1B0S"/>
          <bitfield caption="Comparator D output mode" mask="0x0C" name="COM1D"/>
          <bitfield caption="Force Output Compare Match 1D" mask="0x02" name="FOC1D"/>
          <bitfield caption="Pulse Width Modulator D Enable" mask="0x01" name="PWM1D"/>
        </register>
        <register caption="Timer/Counter Control Register D" name="TCCR1D" offset="0x46" size="1">
          <bitfield caption="Fault Protection Interrupt Enable" mask="0x80" name="FPIE1"/>
          <bitfield caption="Fault Protection Mode Enable" mask="0x40" name="FPEN1"/>
          <bitfield caption="Fault Protection Noise Canceler" mask="0x20" name="FPNC1"/>
          <bitfield caption="Fault Protection Edge Select" mask="0x10" name="FPES1"/>
          <bitfield caption="Fault Protection Analog Comparator Enable" mask="0x08" name="FPAC1"/>
          <bitfield caption="Fault Protection Interrupt Flag" mask="0x04" name="FPF1"/>
          <bitfield caption="Waveform Generation Mode Bit" mask="0x03" name="WGM1" values="PULSE_WIDTH_MODU2"/>
        </register>
        <register caption="Timer/Counter1 Control Register E" name="TCCR1E" offset="0x20" size="1">
          <bitfield caption="Ouput Compare Override Enable Bits" mask="0x3F" name="OC1OE"/>
        </register>
        <register caption="Timer/Counter Register" name="TCNT1" offset="0x4E" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="Timer/Counter 1 Register High" name="TC1H" offset="0x45" size="1" mask="0x03"/>
        <register caption="Output Compare Register" name="OCR1A" offset="0x4D" size="1" mask="0xFF"/>
        <register caption="Output Compare Register" name="OCR1B" offset="0x4C" size="1" mask="0xFF"/>
        <register caption="Output compare register" name="OCR1C" offset="0x4B" size="1" mask="0xFF"/>
        <register caption="Output compare register" name="OCR1D" offset="0x4A" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x59" size="1">
          <bitfield caption="OCIE1D: Timer/Counter1 Output Compare Interrupt Enable" mask="0x80" name="OCIE1D"/>
          <bitfield caption="OCIE1A: Timer/Counter1 Output Compare Interrupt Enable" mask="0x40" name="OCIE1A"/>
          <bitfield caption="OCIE1A: Timer/Counter1 Output Compare B Interrupt Enable" mask="0x20" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x04" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag Register" name="TIFR" offset="0x58" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter1 Output Compare Flag 1D" mask="0x80" name="OCF1D"/>
          <bitfield caption="Timer/Counter1 Output Compare Flag 1A" mask="0x40" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Output Compare Flag 1B" mask="0x20" name="OCF1B"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
        </register>
        <register caption="Timer/Counter 1 Dead Time Value" name="DT1" offset="0x44" size="1">
          <bitfield mask="0xF0" name="DT1H"/>
          <bitfield mask="0x0F" name="DT1L"/>
        </register>
      </register-group>
      <value-group name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x02"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x03"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x04"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="RUNNING_EXTCLK_TN_FALLING_EDGE" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="RUNNING_EXTCLK_TN_RISING_EDGE" value="0x07"/>
      </value-group>
      <value-group name="MISC_2BIT_SCALE">
        <value caption="1x" name="1X" value="0x00"/>
        <value caption="2x" name="2X" value="0x01"/>
        <value caption="4x" name="4X" value="0x02"/>
        <value caption="8x" name="8X" value="0x03"/>
      </value-group>
      <value-group name="CLK_SEL_4BIT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/2" name="RUNNING_CLK_2" value="0x02"/>
        <value caption="Running, CLK/4" name="RUNNING_CLK_4" value="0x03"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x04"/>
        <value caption="Running, CLK/16" name="RUNNING_CLK_16" value="0x05"/>
        <value caption="Running, CLK/32" name="RUNNING_CLK_32" value="0x06"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x07"/>
        <value caption="Running, CLK/128" name="RUNNING_CLK_128" value="0x08"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x09"/>
        <value caption="Running, CLK/512" name="RUNNING_CLK_512" value="0x0A"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x0B"/>
        <value caption="Running, CLK/2048" name="RUNNING_CLK_2048" value="0x0C"/>
        <value caption="Running, CLK/4096" name="RUNNING_CLK_4096" value="0x0D"/>
        <value caption="Running, CLK/8192" name="RUNNING_CLK_8192" value="0x0E"/>
        <value caption="Running, CLK/16384" name="RUNNING_CLK_16384" value="0x0F"/>
      </value-group>
      <value-group name="PULSE_WIDTH_MODU2">
        <value caption="Fast PWM (NB! PWMx must be set!)" name="FAST_PWM_NB_PWMX_MUST_BE_SET" value="0x00"/>
        <value caption="Phase and Frequency Correct PWM" name="PHASE_AND_FREQUENCY_CORRECT_PWM" value="0x01"/>
        <value caption="PWM6/Single-slope" name="PWM6_SINGLE_SLOPE" value="0x02"/>
        <value caption="PWM6/Dual-slope" name="PWM6_DUAL_SLOPE" value="0x03"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1" ocd-rw="R">
          <bitfield caption="Clear temporary page buffer" mask="0x10" name="CTPB"/>
          <bitfield caption="Read fuse and lock bits" mask="0x08" name="RFLB"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Power Reduction Register" name="PRR" offset="0x56" size="1">
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x04" name="PRTIM0"/>
          <bitfield caption="Power Reduction USI" mask="0x02" name="PRUSI"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="Stack Pointer  Bytes" name="SP" offset="0x5D" size="2" mask="0x01FF"/>
